{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Structured report mapping features to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the Valentine app.",
  "frontend/index.css": "Tailwind base config with OKLCH pink-focused theme tokens and light/dark mode variables.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Controls view transitions between choice, bad-bad dialog, and pookie dialog with optional confetti.",
  "frontend/src/components/valentine/BadBadDialog.tsx": "Popup dialog showing 'no you're pookie' with decorative hearts and a go-back button.",
  "frontend/src/components/valentine/ChoiceCard.tsx": "Main choice card presenting 'What are you?' with 'bad bad' and 'pookie' buttons and themed decorations.",
  "frontend/src/components/valentine/HeartConfetti.tsx": "Generates animated falling heart confetti using randomized styles.",
  "frontend/src/components/valentine/PookieMessageDialog.tsx": "Romantic message dialog with themed decorations, close control, and multi-line Valentine text.",
  "frontend/src/components/valentine/ValentineLayout.tsx": "App-wide layout with themed background, floating heart decorations, and a footer.",
  "frontend/src/hooks/useActor.ts": "React Query hook creating and refreshing a backend actor based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication with login, logout, and identity loading logic. Handles AuthClient creation and exposes login status helpers.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder module indicating no backend queries are used.",
  "frontend/src/index.css": "Defines global Tailwind layers and custom pink Valentine-themed color variables, fonts, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, radii, shadows, and animations to support the custom Valentine design.",
  "project_state.json": "JSON file describing the project's current state, feature list, requirements, and expected assets for the Valentine-themed app."
}